<a href="https://colab.research.google.com/github/devdc142196/python/blob/main/Day1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
print("hello world")

hello world

In [ ]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
# Create a Spark session
spark =SparkSession.builder.appName("dev").getOrCreate()

data = [
(1,10),(2,20),(3,30),(4,40),(5,50)
]
columns=["id","value"]
# Create DataFrame
df = spark.createDataFrame(data,columns)
# Show the DataFrame
df.show()
x=df.count()

print("number of rows in above  dataframe is:",x)

#sum

sm=df.select(sum("value").alias("sum"))
sm.show()
avg=df.select(avg("value").alias("avg")).show()
#max
mx=df.select(max("value").alias("max")).show()
#min
mn=df.select(min("value").alias("min")).show()
#cnt
mn=df.select(count("value").alias("count")).show()

+---+-----+
| id|value|
+---+-----+
|  1|   10|
|  2|   20|
|  3|   30|
|  4|   40|
|  5|   50|
+---+-----+

number of rows in above  dataframe is: 5
+---+
|sum|
+---+
|150|
+---+

+----+
| avg|
+----+
|30.0|
+----+

+---+
|max|
+---+
| 50|
+---+

+---+
|min|
+---+
| 10|
+---+

+-----+
|count|
+-----+
|    5|
+-----+

In [ ]:
''''a=int(input("enter first numner:"))
b=int(input("enter second numner:"))
sum = a+b
print("sum of entered numbers is:",sum)'''

for i in range(1,11):
    print(i)

for x in ("hello"):
  print(x)

for x in ("hello","hi im dev"):
  print(x)

z=[1,'dev','c']
for c in z:
  print(c)

1
2
3
4
5
6
7
8
9
10
h
e
l
l
o
hello
hi im dev
1
dev
c

In [ ]:
for i in range(3,20,3):
  print(i)

list(range(10))
list(range(1,10))
list(range(-6,10))

3
6
9
12
15
18

[-6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [ ]:
numbers = [1, 2, 3, 4, 5]
total = 0

for i in numbers:
  total = total + i
print(total)

for i in range(2,5):
  for j in range(i):
    print("*",end="")
  print()

15
**
***
****

In [2]:
from pyspark.sql import SparkSession
from pyspark.sql import Row
from pyspark.sql.functions import *

# Create a Spark session
spark =SparkSession.builder.appName("dev").getOrCreate()
# Sample DataFrames
emp_data = [ Row(emp_id=1, emp_name="Alice", emp_salary=50000, emp_dept_id=101, emp_location="New York"),
             Row(emp_id=2, emp_name="Bob", emp_salary=60000, emp_dept_id=102, emp_location="Los Angeles"),
             Row(emp_id=3, emp_name="Charlie", emp_salary=55000, emp_dept_id=101, emp_location="Chicago"),
             Row(emp_id=4, emp_name="David", emp_salary=70000, emp_dept_id=103, emp_location="San Francisco"),
             Row(emp_id=5, emp_name="Eve", emp_salary=48000, emp_dept_id=102, emp_location="Houston") ]
dept_data = [Row(dept_id=101, dept_name="Engineering", dept_head="John", dept_location="New York"),
             Row(dept_id=102, dept_name="Marketing", dept_head="Mary", dept_location="Los Angeles"),
             Row(dept_id=103, dept_name="Finance", dept_head="Frank", dept_location="Chicago") ]

emp_columns = ["emp_id", "emp_name", "emp_salary", "emp_dept_id", "emp_location"]
dept_columns = ["dept_id", "dept_name", "dept_head", "dept_location"]
emp_df = spark.createDataFrame(emp_data, emp_columns)
dept_df = spark.createDataFrame(dept_data, dept_columns)

# Display emp data print("emp_data:")
emp_df.show()
# Display dept data print("dept_data:")
dept_df.show()

+------+--------+----------+-----------+-------------+
|emp_id|emp_name|emp_salary|emp_dept_id| emp_location|
+------+--------+----------+-----------+-------------+
|     1|   Alice|     50000|        101|     New York|
|     2|     Bob|     60000|        102|  Los Angeles|
|     3| Charlie|     55000|        101|      Chicago|
|     4|   David|     70000|        103|San Francisco|
|     5|     Eve|     48000|        102|      Houston|
+------+--------+----------+-----------+-------------+

+-------+-----------+---------+-------------+
|dept_id|  dept_name|dept_head|dept_location|
+-------+-----------+---------+-------------+
|    101|Engineering|     John|     New York|
|    102|  Marketing|     Mary|  Los Angeles|
|    103|    Finance|    Frank|      Chicago|
+-------+-----------+---------+-------------+

In [3]:
from pyspark.sql.functions import col

# Join the two DataFrames based on department ID and location
joined_df = emp_df.join(dept_df, (emp_df.emp_dept_id == dept_df.dept_id) & (emp_df.emp_location == dept_df.dept_location), "inner")

# Select the desired columns
result_df = joined_df.select(
    col("emp_id"),
    col("emp_name"),
    col("emp_location"),
    col("dept_name"),
    col("dept_location")
)

# Display the results
result_df.show()

+------+--------+------------+-----------+-------------+
|emp_id|emp_name|emp_location|  dept_name|dept_location|
+------+--------+------------+-----------+-------------+
|     1|   Alice|    New York|Engineering|     New York|
|     2|     Bob| Los Angeles|  Marketing|  Los Angeles|
+------+--------+------------+-----------+-------------+

In [14]:
#Write a PySpark query to get the average salary of employees
# in each department, displaying dept_name
# and the calculated average_salary.
from pyspark.sql.functions import *

# Join the two DataFrames based on department ID and location
joined_df1 = emp_df.join(dept_df, (emp_df.emp_dept_id == dept_df.dept_id), "inner")
joined_df1.show()

df3=joined_df1.filter((col("dept_name") == "Engineering") & (col("dept_head") == "John") & (col("emp_name")=='Alice'))
df4=df3.drop("emp_dept_id","dept_location").withColumnRenamed("emp_salary","Employee_salary")
df4.show()

df2=joined_df1.groupBy("dept_name").agg(avg("emp_salary").alias("average_salary"))
# df2.show()

+------+--------+----------+-----------+-------------+-------+-----------+---------+-------------+
|emp_id|emp_name|emp_salary|emp_dept_id| emp_location|dept_id|  dept_name|dept_head|dept_location|
+------+--------+----------+-----------+-------------+-------+-----------+---------+-------------+
|     1|   Alice|     50000|        101|     New York|    101|Engineering|     John|     New York|
|     3| Charlie|     55000|        101|      Chicago|    101|Engineering|     John|     New York|
|     2|     Bob|     60000|        102|  Los Angeles|    102|  Marketing|     Mary|  Los Angeles|
|     5|     Eve|     48000|        102|      Houston|    102|  Marketing|     Mary|  Los Angeles|
|     4|   David|     70000|        103|San Francisco|    103|    Finance|    Frank|      Chicago|
+------+--------+----------+-----------+-------------+-------+-----------+---------+-------------+

+------+--------+---------------+------------+-------+-----------+---------+
|emp_id|emp_name|Employee_salary|emp_location|dept_id|  dept_name|dept_head|
+------+--------+---------------+------------+-------+-----------+---------+
|     1|   Alice|          50000|    New York|    101|Engineering|     John|
+------+--------+---------------+------------+-------+-----------+---------+

In [17]:
from pyspark.sql import SparkSession
from pyspark.sql import Row
from pyspark.sql.functions import *

# Create a Spark session (if not already created)
spark = SparkSession.builder.appName("dev").getOrCreate()

# Sample DataFrames
customers_data = [
    Row(customer_id=1, customer_name="John Doe", city="New York"),
    Row(customer_id=2, customer_name="Jane Smith", city="Los Angeles"),
    Row(customer_id=3, customer_name="David Lee", city="Chicago"),
    Row(customer_id=4, customer_name="Sarah Jones", city="Houston")
]
orders_data = [
    Row(order_id=101, customer_id=1, order_date="2023-10-26", order_amount=100),
    Row(order_id=102, customer_id=2, order_date="2023-10-26", order_amount=200),
    Row(order_id=103, customer_id=1, order_date="2023-10-27", order_amount=150),
    Row(order_id=104, customer_id=3, order_date="2023-10-27", order_amount=300)
]

customers_columns = ["customer_id", "customer_name", "city"]
orders_columns = ["order_id", "customer_id", "order_date", "order_amount"]
customers_df = spark.createDataFrame(customers_data, customers_columns)
orders_df = spark.createDataFrame(orders_data, orders_columns)

customers_df.show()
orders_df.show()

dc1=customers_df.join(orders_df,customers_df.customer_id==orders_df.customer_id,"inner")\
.select(customers_df.customer_name,orders_df.order_date,orders_df.order_amount)\
.filter(col("order_amount")>100)
dc1.show()

+-----------+-------------+-----------+
|customer_id|customer_name|       city|
+-----------+-------------+-----------+
|          1|     John Doe|   New York|
|          2|   Jane Smith|Los Angeles|
|          3|    David Lee|    Chicago|
|          4|  Sarah Jones|    Houston|
+-----------+-------------+-----------+

+--------+-----------+----------+------------+
|order_id|customer_id|order_date|order_amount|
+--------+-----------+----------+------------+
|     101|          1|2023-10-26|         100|
|     102|          2|2023-10-26|         200|
|     103|          1|2023-10-27|         150|
|     104|          3|2023-10-27|         300|
+--------+-----------+----------+------------+

+-------------+----------+------------+
|customer_name|order_date|order_amount|
+-------------+----------+------------+
|     John Doe|2023-10-27|         150|
|   Jane Smith|2023-10-26|         200|
|    David Lee|2023-10-27|         300|
+-------------+----------+------------+